app/views/user/show.html.erb


<%posts = @a.posts.all%>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]